<template>
  <div class="container">
    <div class="position">
      所在的位置：盘点管理 -> <span>材料统计</span>
    </div>
    <br/>
    <div class="john-tab">
      <b>
        <!--仓库共计材料：      件   本场所查询结果：   {{total}}  件-->
        <el-button
          size="mini"
          style="float: left;margin-left: 15px;"
          type="primary"
          @click="toUpdate">明细</el-button>
      </b>
    </div>
    <div class="data-list">
      <el-table
        v-show="johnTab == 0"
        :data="data1"
        border
        height="calc(100% - 0px)"
        @selection-change="handleSelectionChange">
        <el-table-column
          type="selection"
          fixed
          width="55">
        </el-table-column>
        <el-table-column
          type="index"
          label="序号"
          fixed
          width="55">
        </el-table-column>
        <el-table-column
          prop="仓库名代码"
          label="仓库名代码"
          width="100">
        </el-table-column>
        <el-table-column
          prop="库存号码"
          label="库存号码"
          width="100">
        </el-table-column>
        <el-table-column
          prop="行业规格"
          label="行业规格"
          width="100">
        </el-table-column>
        <el-table-column
          prop="钢种"
          label="钢种">
        </el-table-column>
        <el-table-column
          prop="形状"
          label="形状"
          width="130">
        </el-table-column>
        <el-table-column
          prop="数量"
          label="数量">
        </el-table-column>
        <el-table-column
          prop="重量"
          label="重量"
          width="60">
        </el-table-column>
        <el-table-column
          prop="替换钢种"
          align="替换钢种"
          label="厚">
        </el-table-column>
        <el-table-column
          prop="母材尺寸"
          label="母材尺寸">
        </el-table-column>
        <el-table-column
          prop="放置位置"
          label="放置位置">
        </el-table-column>
        <el-table-column
          prop="备注"
          label="备注">
        </el-table-column>
        <el-table-column
          prop="入出库日期"
          label="入出库日期">
        </el-table-column>
        <el-table-column
          prop="是否标记"
          label="是否标记"
          width="80px">
        </el-table-column>
        <el-table-column
          prop="盘点人"
          label="盘点人">
        </el-table-column>

        <el-table-column
          align="right"
          label="操作">
          <template>
            <el-button @click="dialog = true" type="text">详情</el-button>
          </template>
        </el-table-column>
      </el-table>
      <div class="block">
        <el-pagination
          @size-change="handleSizeChange"
          @current-change="handleCurrentChange"
          :current-page="1"
          :page-sizes="[30, 50, 100]"
          :page-size="30"
          layout="total, sizes, prev, pager, next, jumper"
          :total="30">
        </el-pagination>
      </div>
    </div>
    <el-table
      id="out-table"
      style="display: none"
      :data="multipleSelection">
      <el-table-column
        prop="whseCd"
        label="仓库名代码">
      </el-table-column>
      <el-table-column
        prop="stockNo"
        label="库存号码">
      </el-table-column>
      <el-table-column
        prop="matCntlNo"
        label="现品管理号">
      </el-table-column>
      <el-table-column
        prop="caseNo"
        label="包装箱号">
      </el-table-column>
      <el-table-column
        prop="gradeCdKey"
        label="钢种">
      </el-table-column>
      <el-table-column
        prop="changeNo"
        label="溶解编号">
      </el-table-column>
      <el-table-column
        prop="shape"
        label="形状"
        width="60">
      </el-table-column>
      <el-table-column
        prop="size1"
        align="right"
        label="厚">
      </el-table-column>
      <el-table-column
        prop="size2"
        align="right"
        label="宽">
      </el-table-column>
      <el-table-column
        prop="size3"
        align="right"
        label="长">
      </el-table-column>
      <el-table-column
        prop="stockQty"
        align="right"
        label="数量">
      </el-table-column>
      <el-table-column
        prop="stockWt"
        align="right"
        label="重量">
      </el-table-column>
      <el-table-column
        label="是否已选"
        width="80px">
        <template slot-scope="scope">
          {{scope.row.selectEndTime ? '是' : '否'}}
        </template>
      </el-table-column>
      <el-table-column
        prop="replaceGrade"
        label="替换钢种">
        <tempate slot-scope="scope">
          {{scope.row.replaceGrade ? '是' : '否'}}
        </tempate>
      </el-table-column>
      <el-table-column
        label="选料时间"
        width="140">
        <template slot-scope="scope">
          {{$store.getters.getDate(scope.row.selectEndTime, 1)}}
        </template>
      </el-table-column>
      <el-table-column
        prop="selectSoNo"
        label="已选接单"
        width="130">
      </el-table-column>
      <el-table-column
        prop="orgSizeNote"
        label="母材尺寸"
        width="180px">
      </el-table-column>
      <el-table-column
        prop="storageName"
        label="放置位置">
      </el-table-column>
      <el-table-column
        prop="stockRemarks"
        label="备注">
      </el-table-column>
      <el-table-column
        label="入出库日期">
        <template slot-scope="scope">
          {{$store.getters.getDate(scope.row.latestToDate, 2)}}
        </template>
      </el-table-column>
      <el-table-column
        prop="soNo"
        label="接单号码">
      </el-table-column>
      <el-table-column
        label="入库时间">
        <template slot-scope="scope">
          {{$store.getters.getDate(scope.row.lastStorageTime, 2)}}
        </template>
      </el-table-column>
      <el-table-column
        prop="printCount"
        align="right"
        label="打印次数">
      </el-table-column>
      <el-table-column
        prop="isPaste"
        :formatter="isPaste"
        label="是否标记">
      </el-table-column>
      <el-table-column
        prop="lastInvUserName"
        label="盘点人">
      </el-table-column>
    </el-table>
    <el-dialog
      width="610px"
      :visible.sync="elDialog">
      <printQR v-if="elDialog" :qrCodes="qrCodes"/>
    </el-dialog>
    <el-dialog
      title="明细"
      :visible.sync="updateDialog"
      width="1670px">
      <toUpdate :data2="data2" v-if="updateDialog"/>
    </el-dialog>
    <el-dialog
      width="900px"
      title="详情"
      top="10vh"
      custom-class="min-height"
      :close-on-click-modal="false"
      :visible.sync="dialog">
      <table boderColor="#ccc" border="1" class="table" style="width: 100%;">
        <tr>
          <td>仓库名代码</td>
          <td>100</td>
          <td>库存号码</td>
          <td>000000001</td>
          <td>行业规格</td>
          <td>热作钢</td>
        </tr>
        <tr>
          <td>钢种</td>
          <td>BKH-13R</td>
          <td>形状</td>
          <td>R</td>
          <td>数量</td>
          <td>1367</td>
        </tr>
        <tr>
          <td>重量</td>
          <td>14.758</td>
          <td>替换钢种</td>
          <td>无</td>
          <td>母材尺寸</td>
          <td></td>
        </tr>
        <tr>
          <td>放置位置</td>
          <td>A区</td>
          <td>备注</td>
          <td>无</td>
          <td>入出库日期</td>
          <td>20/05/30</td>
        </tr>
        <tr>
          <td>是否标记</td>
          <td></td>
          <td>盘点人</td>
          <td>周小青</td>
          <td></td>
          <td></td>
        </tr>
      </table>
    </el-dialog>
  </div>
</template>

<script>
import printQR from './printQR'
import FileSaver from 'file-saver'
import toUpdate from './toUpdate'
import XLSX from 'xlsx'
import orderDetail from '../materialSelect/material'
import { PlTable, PlTableColumn, PlxTableGrid, PlxTableColumn } from 'pl-table'
let data1 = [
  {"仓库名代码":100,"库存号码":'000000001',"行业规格":"-","钢种":"BKH-13R","形状":"R","数量":1367,"重量":14.758,"替换钢种":"无","母材尺寸":"","放置位置":"A区","备注":"","入出库日期":" 20/05/30 ","是否标记":"","盘点人":"周小青"},
  {"仓库名代码":100,"库存号码":'000000002',"行业规格":"热作钢","钢种":"DAC","形状":"R","数量":454,"重量":588.944,"替换钢种":"无","母材尺寸":"","放置位置":"A区","备注":"","入出库日期":" 20/05/30 ","是否标记":"","盘点人":"周小青"},
  {"仓库名代码":100,"库存号码":'000000003',"行业规格":"热作钢","钢种":"DAC-MAGIC","形状":"F","数量":1,"重量":4.414,"替换钢种":"无","母材尺寸":"","放置位置":"B区","备注":"","入出库日期":" 20/05/30","是否标记":"","盘点人":"周小青"},
  {"仓库名代码":100,"库存号码":'000000004',"行业规格":"热作钢","钢种":"DAC-P","形状":"F","数量":1,"重量":13.97,"替换钢种":"无","母材尺寸":"","放置位置":"B区","备注":"","入出库日期":" 20/05/30","是否标记":"","盘点人":"周小青"},
  {"仓库名代码":100,"库存号码":'000000005',"行业规格":"热作钢","钢种":"DAC-S","形状":"F","数量":1,"重量":7.544,"替换钢种":"无","母材尺寸":"","放置位置":"B区","备注":"","入出库日期":" 20/05/30","是否标记":"","盘点人":"周小青"},
  {"仓库名代码":100,"库存号码":'000000006',"行业规格":"高速钢","钢种":"HAP40","形状":"RG/F","数量":1199,"重量":584.72,"替换钢种":"无","母材尺寸":"","放置位置":"B区","备注":"","入出库日期":" 20/05/30","是否标记":"","盘点人":"周小青"},
  {"仓库名代码":100,"库存号码":'000000007',"行业规格":"高速钢","钢种":"HAP-T15","形状":"RG","数量":5,"重量":1.192,"替换钢种":"无","母材尺寸":"","放置位置":"B区","备注":"","入出库日期":" 20/05/30","是否标记":"","盘点人":"周小青"},
  {"仓库名代码":100,"库存号码":'000000008',"行业规格":"塑料钢","钢种":"HPM38","形状":"F","数量":1,"重量":2.94,"替换钢种":"无","母材尺寸":"","放置位置":"B区","备注":"","入出库日期":" 20/05/30","是否标记":"","盘点人":"周小青"},
  {"仓库名代码":100,"库存号码":'000000009',"行业规格":"无磁钢","钢种":"HPM75","形状":"F","数量":9,"重量":34.578,"替换钢种":"无","母材尺寸":"","放置位置":"C区","备注":"","入出库日期":" 20/05/30","是否标记":"","盘点人":"周小青"},
  {"仓库名代码":100,"库存号码":'000000010',"行业规格":"塑料钢","钢种":"HPM-MAGIC","形状":"R","数量":134,"重量":4.941,"替换钢种":"无","母材尺寸":"","放置位置":"C区","备注":"","入出库日期":" 20/05/30","是否标记":"","盘点人":"周小青"},
  {"仓库名代码":100,"库存号码":'000000011',"行业规格":"-","钢种":"NCENA-1R","形状":"R","数量":77,"重量":0.642,"替换钢种":"无","母材尺寸":"","放置位置":"C区","备注":"","入出库日期":" 20/05/30","是否标记":"","盘点人":"周小青"},
  {"仓库名代码":100,"库存号码":'000000012',"行业规格":"-","钢种":"NH-61R","形状":"R","数量":159,"重量":2.76,"替换钢种":"无","母材尺寸":"","放置位置":"C区","备注":"","入出库日期":" 20/05/30","是否标记":"","盘点人":"周小青"},
  {"仓库名代码":100,"库存号码":'000000013',"行业规格":"-","钢种":"NH-9R","形状":"R","数量":309,"重量":5,"替换钢种":"无","母材尺寸":"","放置位置":"C区","备注":"","入出库日期":" 20/05/30","是否标记":"","盘点人":"周小青"},
  {"仓库名代码":100,"库存号码":'000000014',"行业规格":"-","钢种":"NSM-1R","形状":"R","数量":1631,"重量":12.508,"替换钢种":"无","母材尺寸":"","放置位置":"C区","备注":"","入出库日期":" 20/05/30","是否标记":"","盘点人":"周小青"},
  {"仓库名代码":100,"库存号码":'000000015',"行业规格":"冷作钢","钢种":"SLD","形状":"R","数量":311,"重量":856.808,"替换钢种":"无","母材尺寸":"","放置位置":"C区","备注":"","入出库日期":" 20/05/30","是否标记":"","盘点人":"周小青"},
  {"仓库名代码":100,"库存号码":'000000016',"行业规格":"冷作钢","钢种":"SLD-MAGIC","形状":"R/F","数量":115,"重量":188.963,"替换钢种":"无","母材尺寸":"","放置位置":"C区","备注":"","入出库日期":" 20/05/30","是否标记":"","盘点人":"周小青"},
  {"仓库名代码":100,"库存号码":'000000017',"行业规格":"-","钢种":"YAG250","形状":"R","数量":309,"重量":0.969,"替换钢种":"无","母材尺寸":"","放置位置":"C区","备注":"","入出库日期":" 20/05/30","是否标记":"","盘点人":"周小青"},
  {"仓库名代码":100,"库存号码":'000000018',"行业规格":"高速钢","钢种":"YXM1","形状":"R/F","数量":438,"重量":1860.011,"替换钢种":"无","母材尺寸":"","放置位置":"B区","备注":"","入出库日期":" 20/05/30","是否标记":"","盘点人":"周小青"},
  {"仓库名代码":100,"库存号码":'000000019',"行业规格":"高速钢","钢种":"YXM27C","形状":"","数量":4,"重量":2,"替换钢种":"无","母材尺寸":"","放置位置":"C区","备注":"","入出库日期":" 20/05/30","是否标记":"","盘点人":"周小青"},
]

let data2 = [
    {"仓库名代码":100,"包装箱号":"热作钢","钢种":"DAC","形状":"R","厚(mm)":10,"宽(mm)":0,"长(mm)":1970,"数量":1,"重量(kg)":1.215,"替换钢种":" 否 ","母材尺寸":"R 10MM","放置位置":"","备注":"","入出库日期":"2020/5/30","是否标记":"是","盘点人":"周小青"},
    {"仓库名代码":100,"包装箱号":"热作钢","钢种":"DAC","形状":"R","厚(mm)":10,"宽(mm)":0,"长(mm)":1965,"数量":1,"重量(kg)":1.211,"替换钢种":" 否 ","母材尺寸":"R 10MM","放置位置":"","备注":"","入出库日期":"2020/5/30","是否标记":"是","盘点人":"周小青"},
    {"仓库名代码":100,"包装箱号":"热作钢","钢种":"DAC","形状":"R","厚(mm)":10,"宽(mm)":0,"长(mm)":1961,"数量":1,"重量(kg)":1.209,"替换钢种":" 否 ","母材尺寸":"R 10MM","放置位置":"","备注":"","入出库日期":"2020/5/30","是否标记":"是","盘点人":"周小青"},
    {"仓库名代码":100,"包装箱号":"热作钢","钢种":"DAC","形状":"R","厚(mm)":10,"宽(mm)":0,"长(mm)":1960,"数量":1,"重量(kg)":1.208,"替换钢种":" 否 ","母材尺寸":"R 10MM","放置位置":"","备注":"","入出库日期":"2020/5/30","是否标记":"是","盘点人":"周小青"},
    {"仓库名代码":100,"包装箱号":"热作钢","钢种":"DAC","形状":"R","厚(mm)":10,"宽(mm)":0,"长(mm)":1903,"数量":1,"重量(kg)":1.173,"替换钢种":" 否 ","母材尺寸":"R 10MM","放置位置":"","备注":"","入出库日期":"2020/5/30","是否标记":"是","盘点人":"周小青"},
    {"仓库名代码":100,"包装箱号":"热作钢","钢种":"DAC","形状":"R","厚(mm)":10,"宽(mm)":0,"长(mm)":1900,"数量":1,"重量(kg)":1.171,"替换钢种":" 否 ","母材尺寸":"R 10MM","放置位置":"","备注":"","入出库日期":"2020/5/30","是否标记":"是","盘点人":"周小青"},
    {"仓库名代码":100,"包装箱号":"热作钢","钢种":"DAC","形状":"R","厚(mm)":10,"宽(mm)":0,"长(mm)":958,"数量":2,"重量(kg)":1.182,"替换钢种":" 否 ","母材尺寸":"R 10X1961MM","放置位置":"","备注":"","入出库日期":"2020/5/30","是否标记":"是","盘点人":"周小青"},
    {"仓库名代码":100,"包装箱号":"热作钢","钢种":"DAC","形状":"R","厚(mm)":10,"宽(mm)":0,"长(mm)":957,"数量":2,"重量(kg)":1.18,"替换钢种":" 否 ","母材尺寸":"R 10MM","放置位置":"","备注":"","入出库日期":"2020/5/30","是否标记":"是","盘点人":"周小青"},
    {"仓库名代码":100,"包装箱号":"热作钢","钢种":"DAC","形状":"R","厚(mm)":10,"宽(mm)":0,"长(mm)":955,"数量":3,"重量(kg)":2.945,"替换钢种":" 否 ","母材尺寸":"R 10MM","放置位置":"","备注":"","入出库日期":"2020/5/30","是否标记":"是","盘点人":"周小青"},
    {"仓库名代码":100,"包装箱号":"热作钢","钢种":"DAC","形状":"R","厚(mm)":10,"宽(mm)":0,"长(mm)":950,"数量":4,"重量(kg)":2.344,"替换钢种":" 否 ","母材尺寸":"R 10X1955MM","放置位置":"","备注":"","入出库日期":"2020/5/30","是否标记":"是","盘点人":"周小青"},
    {"仓库名代码":100,"包装箱号":"热作钢","钢种":"DAC","形状":"R","厚(mm)":10,"宽(mm)":0,"长(mm)":900,"数量":1,"重量(kg)":0.555,"替换钢种":" 否 ","母材尺寸":"R 10MM","放置位置":"","备注":"","入出库日期":"2020/5/30","是否标记":"是","盘点人":"周小青"},
    {"仓库名代码":100,"包装箱号":"热作钢","钢种":"DAC","形状":"R","厚(mm)":10,"宽(mm)":0,"长(mm)":880,"数量":10,"重量(kg)":5.43,"替换钢种":" 否 ","母材尺寸":"R 10X1957MM","放置位置":"","备注":"","入出库日期":"2020/5/30","是否标记":"是","盘点人":"周小青"},
    {"仓库名代码":100,"包装箱号":"热作钢","钢种":"DAC","形状":"R","厚(mm)":3,"宽(mm)":0,"长(mm)":1000,"数量":125,"重量(kg)":6.959,"替换钢种":" 否 ","母材尺寸":"R 0MM","放置位置":"","备注":"","入出库日期":"2020/5/30","是否标记":"是","盘点人":"周小青"},
    {"仓库名代码":100,"包装箱号":"热作钢","钢种":"DAC","形状":"R","厚(mm)":10,"宽(mm)":0,"长(mm)":851,"数量":1,"重量(kg)":0.525,"替换钢种":" 否 ","母材尺寸":"R 10X2858MM","放置位置":"","备注":"","入出库日期":"2020/5/30","是否标记":"是","盘点人":"周小青"},
    {"仓库名代码":100,"包装箱号":"热作钢","钢种":"DAC","形状":"R","厚(mm)":10,"宽(mm)":0,"长(mm)":650,"数量":50,"重量(kg)":20.05,"替换钢种":" 否 ","母材尺寸":"R 10MM","放置位置":"","备注":"","入出库日期":"2020/5/30","是否标记":"是","盘点人":"周小青"},
    {"仓库名代码":100,"包装箱号":"热作钢","钢种":"DAC","形状":"R","厚(mm)":10,"宽(mm)":0,"长(mm)":645,"数量":11,"重量(kg)":4.23,"替换钢种":" 否 ","母材尺寸":"R 10MM","放置位置":"","备注":"","入出库日期":"2020/5/30","是否标记":"是","盘点人":"周小青"},
    {"仓库名代码":100,"包装箱号":"热作钢","钢种":"DAC","形状":"R","厚(mm)":10,"宽(mm)":0,"长(mm)":640,"数量":32,"重量(kg)":12.635,"替换钢种":" 否 ","母材尺寸":"R 10MM","放置位置":"","备注":"","入出库日期":"2020/5/30","是否标记":"是","盘点人":"周小青"},
    {"仓库名代码":100,"包装箱号":"热作钢","钢种":"DAC","形状":"R","厚(mm)":10,"宽(mm)":0,"长(mm)":0,"数量":207,"重量(kg)":524.9,"替换钢种":" 否 ","母材尺寸":"","放置位置":"","备注":"","入出库日期":"2020/5/30","是否标记":"是","盘点人":"周小青"},
    {"仓库名代码":100,"包装箱号":"-","钢种":"BKH-13R","形状":"R","厚(mm)":1,"宽(mm)":0,"长(mm)":1000,"数量":837,"重量(kg)":4.994,"替换钢种":" 否 ","母材尺寸":"","放置位置":"","备注":"","入出库日期":"2020/5/30","是否标记":"数据与标签不一致","盘点人":"周小青"},
    {"仓库名代码":100,"包装箱号":"-","钢种":"BKH-13R","形状":"R","厚(mm)":2,"宽(mm)":0,"长(mm)":1000,"数量":202,"重量(kg)":4.764,"替换钢种":" 否 ","母材尺寸":"","放置位置":"","备注":"","入出库日期":"2020/5/30","是否标记":"是","盘点人":"周小青"},
    {"仓库名代码":100,"包装箱号":"-","钢种":"BKH-13R","形状":"R","厚(mm)":1.6,"宽(mm)":0,"长(mm)":1000,"数量":328,"重量(kg)":5,"替换钢种":" 否 ","母材尺寸":"","放置位置":"","备注":"","入出库日期":"2020/5/30","是否标记":"是","盘点人":"周小青"},
    {"仓库名代码":100,"包装箱号":"热作钢","钢种":"DAC-MAGIC","形状":"F","厚(mm)":11,"宽(mm)":120,"长(mm)":426,"数量":1,"重量(kg)":4.414,"替换钢种":" 否 ","母材尺寸":"F 78X200X426MM","放置位置":"","备注":"","入出库日期":"2020/5/30","是否标记":"是","盘点人":"周小青"},
    {"仓库名代码":100,"包装箱号":"热作钢","钢种":"DAC-P","形状":"F","厚(mm)":11,"宽(mm)":354,"长(mm)":457,"数量":1,"重量(kg)":13.97,"替换钢种":" 否 ","母材尺寸":"F 350X920MM","放置位置":"","备注":"","入出库日期":"2020/5/30","是否标记":"是","盘点人":"周小青"},
    {"仓库名代码":100,"包装箱号":"热作钢","钢种":"DAC-S","形状":"F","厚(mm)":8,"宽(mm)":205,"长(mm)":586,"数量":1,"重量(kg)":7.544,"替换钢种":" 否 ","母材尺寸":"F 8X205X645MM","放置位置":"","备注":"","入出库日期":"2020/5/30","是否标记":"是","盘点人":"周小青"},
    {"仓库名代码":100,"包装箱号":"高速钢","钢种":"HAP40","形状":"RG","厚(mm)":10.3,"宽(mm)":0,"长(mm)":351,"数量":1,"重量(kg)":0.237,"替换钢种":" 否 ","母材尺寸":"RG 10.3X518MM","放置位置":"","备注":"","入出库日期":"2020/5/30","是否标记":"是","盘点人":"周小青"},
    {"仓库名代码":100,"包装箱号":"高速钢","钢种":"HAP40","形状":"F","厚(mm)":10,"宽(mm)":155,"长(mm)":2227,"数量":1,"重量(kg)":27.96,"替换钢种":" 否 ","母材尺寸":"F 10X155X2432MM","放置位置":"","备注":"","入出库日期":"2020/5/30","是否标记":"是","盘点人":"周小青"},
    {"仓库名代码":100,"包装箱号":"高速钢","钢种":"HAP40","形状":"F","厚(mm)":10,"宽(mm)":155,"长(mm)":0,"数量":6,"重量(kg)":316,"替换钢种":" 否 ","母材尺寸":"","放置位置":"","备注":"","入出库日期":"2020/5/30","是否标记":"是","盘点人":"周小青"},
    {"仓库名代码":100,"包装箱号":"高速钢","钢种":"HAP40","形状":"RG","厚(mm)":4.3,"宽(mm)":0,"长(mm)":1496,"数量":1,"重量(kg)":0.176,"替换钢种":" 否 ","母材尺寸":"RG 4.3MM","放置位置":"","备注":"","入出库日期":"2020/5/30","是否标记":"是","盘点人":"周小青"},
    {"仓库名代码":100,"包装箱号":"高速钢","钢种":"HAP40","形状":"RG","厚(mm)":4.3,"宽(mm)":0,"长(mm)":1280,"数量":3,"重量(kg)":0.453,"替换钢种":" 否 ","母材尺寸":"RG 4.3MM","放置位置":"","备注":"","入出库日期":"2020/5/30","是否标记":"是","盘点人":"周小青"},
    {"仓库名代码":100,"包装箱号":"高速钢","钢种":"HAP40","形状":"RG","厚(mm)":4.3,"宽(mm)":0,"长(mm)":0,"数量":313,"重量(kg)":90.69,"替换钢种":" 否 ","母材尺寸":"","放置位置":"","备注":"","入出库日期":"2020/5/30","是否标记":"是","盘点人":"周小青"},
    {"仓库名代码":100,"包装箱号":"高速钢","钢种":"HAP40","形状":"RG","厚(mm)":3.3,"宽(mm)":0,"长(mm)":1990,"数量":1,"重量(kg)":0.138,"替换钢种":" 否 ","母材尺寸":"RG 3.3MM","放置位置":"","备注":"","入出库日期":"2020/5/30","是否标记":"是","盘点人":"周小青"},
    {"仓库名代码":100,"包装箱号":"高速钢","钢种":"HAP40","形状":"RG","厚(mm)":3.3,"宽(mm)":0,"长(mm)":390,"数量":1,"重量(kg)":0.027,"替换钢种":" 否 ","母材尺寸":"RG 3.3MM","放置位置":"","备注":"","入出库日期":"2020/5/30","是否标记":"是","盘点人":"周小青"},
    {"仓库名代码":100,"包装箱号":"高速钢","钢种":"HAP40","形状":"RG","厚(mm)":3.3,"宽(mm)":0,"长(mm)":308,"数量":1,"重量(kg)":0.021,"替换钢种":" 否 ","母材尺寸":"RG 3.3MM","放置位置":"","备注":"","入出库日期":"2020/5/30","是否标记":"是","盘点人":"周小青"},
    {"仓库名代码":100,"包装箱号":"高速钢","钢种":"HAP40","形状":"RG","厚(mm)":3.3,"宽(mm)":0,"长(mm)":288,"数量":1,"重量(kg)":0.02,"替换钢种":" 否 ","母材尺寸":"RG 3.3MM","放置位置":"","备注":"","入出库日期":"2020/5/30","是否标记":"是","盘点人":"周小青"},
    {"仓库名代码":100,"包装箱号":"高速钢","钢种":"HAP40","形状":"RG","厚(mm)":3.3,"宽(mm)":0,"长(mm)":200,"数量":1,"重量(kg)":0.014,"替换钢种":" 否 ","母材尺寸":"RG 3X1232MM","放置位置":"","备注":"","入出库日期":"2020/5/30","是否标记":"是","盘点人":"周小青"},
    {"仓库名代码":100,"包装箱号":"高速钢","钢种":"HAP40","形状":"RG","厚(mm)":3.3,"宽(mm)":0,"长(mm)":0,"数量":869,"重量(kg)":148.984,"替换钢种":" 否 ","母材尺寸":"","放置位置":"","备注":"","入出库日期":"2020/5/30","是否标记":"是","盘点人":"周小青"},
    {"仓库名代码":100,"包装箱号":"高速钢","钢种":"HAP-T15","形状":"RG","厚(mm)":8.35,"宽(mm)":0,"长(mm)":334,"数量":1,"重量(kg)":0.144,"替换钢种":" 否 ","母材尺寸":"RG 8.35MM","放置位置":"","备注":"","入出库日期":"2020/5/30","是否标记":"是","盘点人":"周小青"},
    {"仓库名代码":100,"包装箱号":"高速钢","钢种":"HAP-T15","形状":"RG","厚(mm)":6.23,"宽(mm)":0,"长(mm)":200,"数量":1,"重量(kg)":0.048,"替换钢种":" 否 ","母材尺寸":"RG 6.23MM","放置位置":"","备注":"","入出库日期":"2020/5/30","是否标记":"是","盘点人":"周小青"},
    {"仓库名代码":100,"包装箱号":"高速钢","钢种":"HAP-T15","形状":"RG","厚(mm)":4.13,"宽(mm)":0,"长(mm)":0,"数量":3,"重量(kg)":1,"替换钢种":" 否 ","母材尺寸":"","放置位置":"","备注":"","入出库日期":"2020/5/30","是否标记":"是","盘点人":"周小青"},
    {"仓库名代码":100,"包装箱号":"塑料钢","钢种":"HPM38","形状":"F","厚(mm)":9,"宽(mm)":204,"长(mm)":204,"数量":1,"重量(kg)":2.94,"替换钢种":" 否 ","母材尺寸":"F 30X204X204MM","放置位置":"","备注":"","入出库日期":"2020/5/30","是否标记":"是","盘点人":"周小青"},
    {"仓库名代码":100,"包装箱号":"无磁钢","钢种":"HPM75","形状":"F","厚(mm)":11,"宽(mm)":235,"长(mm)":287,"数量":1,"重量(kg)":5.824,"替换钢种":" 否 ","母材尺寸":"F 75X285X647MM","放置位置":"","备注":"","入出库日期":"2020/5/30","是否标记":"是","盘点人":"周小青"},
    {"仓库名代码":100,"包装箱号":"无磁钢","钢种":"HPM75","形状":"F","厚(mm)":11,"宽(mm)":235,"长(mm)":244,"数量":1,"重量(kg)":4.951,"替换钢种":" 否 ","母材尺寸":"F 75X285X647MM","放置位置":"","备注":"","入出库日期":"2020/5/30","是否标记":"是","盘点人":"周小青"},
    {"仓库名代码":100,"包装箱号":"无磁钢","钢种":"HPM75","形状":"F","厚(mm)":11,"宽(mm)":147,"长(mm)":267,"数量":4,"重量(kg)":13.556,"替换钢种":" 否 ","母材尺寸":"F 75X305MM","放置位置":"","备注":"","入出库日期":"2020/5/30","是否标记":"是","盘点人":"周小青"},
    {"仓库名代码":100,"包装箱号":"无磁钢","钢种":"HPM75","形状":"F","厚(mm)":10,"宽(mm)":135,"长(mm)":135,"数量":1,"重量(kg)":1.431,"替换钢种":" 否 ","母材尺寸":"F 55X237X346MM","放置位置":"","备注":"","入出库日期":"2020/5/30","是否标记":"是","盘点人":"周小青"},
    {"仓库名代码":100,"包装箱号":"无磁钢","钢种":"HPM75","形状":"F","厚(mm)":10,"宽(mm)":98,"长(mm)":150,"数量":1,"重量(kg)":1.154,"替换钢种":" 否 ","母材尺寸":"F 10X150X305MM","放置位置":"","备注":"","入出库日期":"2020/5/30","是否标记":"是","盘点人":"周小青"},
    {"仓库名代码":100,"包装箱号":"无磁钢","钢种":"HPM75","形状":"F","厚(mm)":8,"宽(mm)":305,"长(mm)":400,"数量":1,"重量(kg)":7.662,"替换钢种":" 否 ","母材尺寸":"F 32X305X400MM","放置位置":"","备注":"","入出库日期":"2020/5/30","是否标记":"是","盘点人":"周小青"},
    {"仓库名代码":100,"包装箱号":"塑料钢","钢种":"HPM-MAGIC","形状":"R","厚(mm)":2.5,"宽(mm)":0,"长(mm)":0,"数量":119,"重量(kg)":4.55,"替换钢种":" 否 ","母材尺寸":"","放置位置":"","备注":"","入出库日期":"2020/5/30","是否标记":"是","盘点人":"周小青"},
    {"仓库名代码":100,"包装箱号":"塑料钢","钢种":"HPM-MAGIC","形状":"R","厚(mm)":2,"宽(mm)":0,"长(mm)":0,"数量":15,"重量(kg)":0.391,"替换钢种":" 否 ","母材尺寸":"","放置位置":"","备注":"","入出库日期":"2020/5/30","是否标记":"是","盘点人":"周小青"},
    {"仓库名代码":100,"包装箱号":"-","钢种":"NCENA-1R","形状":"R","厚(mm)":1.2,"宽(mm)":0,"长(mm)":1000,"数量":77,"重量(kg)":0.642,"替换钢种":" 否 ","母材尺寸":"","放置位置":"","备注":"","入出库日期":"2020/5/30","是否标记":"是","盘点人":"周小青"},
    {"仓库名代码":100,"包装箱号":"-","钢种":"NH-9R","形状":"R","厚(mm)":1.6,"宽(mm)":0,"长(mm)":1000,"数量":309,"重量(kg)":5,"替换钢种":" 否 ","母材尺寸":"","放置位置":"","备注":"","入出库日期":"2020/5/30","是否标记":"是","盘点人":"周小青"},
    {"仓库名代码":100,"包装箱号":"-","钢种":"NSM-1R","形状":"R","厚(mm)":1.6,"宽(mm)":0,"长(mm)":1000,"数量":284,"重量(kg)":4.04,"替换钢种":" 否 ","母材尺寸":"","放置位置":"","备注":"","入出库日期":"2020/5/30","是否标记":"是","盘点人":"周小青"},
    {"仓库名代码":100,"包装箱号":"-","钢种":"NSM-1R","形状":"R","厚(mm)":1,"宽(mm)":0,"长(mm)":1000,"数量":1347,"重量(kg)":8.468,"替换钢种":" 否 ","母材尺寸":"","放置位置":"","备注":"","入出库日期":"2020/5/30","是否标记":"是","盘点人":"周小青"},
    {"仓库名代码":100,"包装箱号":"冷作钢","钢种":"SLD","形状":"R","厚(mm)":12,"宽(mm)":0,"长(mm)":950,"数量":6,"重量(kg)":5.058,"替换钢种":" 否 ","母材尺寸":"R 12MM","放置位置":"","备注":"","入出库日期":"2020/5/30","是否标记":"是","盘点人":"周小青"},
    {"仓库名代码":100,"包装箱号":"冷作钢","钢种":"SLD","形状":"R","厚(mm)":12,"宽(mm)":0,"长(mm)":328,"数量":1,"重量(kg)":0.291,"替换钢种":" 否 ","母材尺寸":"R 12X440MM","放置位置":"","备注":"","入出库日期":"2020/5/30","是否标记":"是","盘点人":"周小青"},
    {"仓库名代码":100,"包装箱号":"冷作钢","钢种":"SLD","形状":"R","厚(mm)":12,"宽(mm)":0,"长(mm)":0,"数量":86,"重量(kg)":311.198,"替换钢种":" 否 ","母材尺寸":"","放置位置":"","备注":"","入出库日期":"2020/5/30","是否标记":"是","盘点人":"周小青"},
    {"仓库名代码":100,"包装箱号":"冷作钢","钢种":"SLD","形状":"R","厚(mm)":10,"宽(mm)":0,"长(mm)":2960,"数量":1,"重量(kg)":1.825,"替换钢种":" 否 ","母材尺寸":"R 10MM","放置位置":"","备注":"","入出库日期":"2020/5/30","是否标记":"是","盘点人":"周小青"},
    {"仓库名代码":100,"包装箱号":"冷作钢","钢种":"SLD","形状":"R","厚(mm)":10,"宽(mm)":0,"长(mm)":950,"数量":4,"重量(kg)":2.344,"替换钢种":" 否 ","母材尺寸":"R 10MM","放置位置":"","备注":"","入出库日期":"2020/5/30","是否标记":"是","盘点人":"周小青"},
    {"仓库名代码":100,"包装箱号":"冷作钢","钢种":"SLD","形状":"R","厚(mm)":10,"宽(mm)":0,"长(mm)":733,"数量":1,"重量(kg)":0.452,"替换钢种":" 否 ","母材尺寸":"R 10X2742MM","放置位置":"","备注":"","入出库日期":"2020/5/30","是否标记":"是","盘点人":"周小青"},
    {"仓库名代码":100,"包装箱号":"冷作钢","钢种":"SLD","形状":"R","厚(mm)":10,"宽(mm)":0,"长(mm)":0,"数量":212,"重量(kg)":535.64,"替换钢种":" 否 ","母材尺寸":"","放置位置":"","备注":"","入出库日期":"2020/5/30","是否标记":"是","盘点人":"周小青"},
    {"仓库名代码":100,"包装箱号":"冷作钢","钢种":"SLD-MAGIC","形状":"F","厚(mm)":11,"宽(mm)":237,"长(mm)":305,"数量":1,"重量(kg)":6.242,"替换钢种":" 否 ","母材尺寸":"F 35X237X305MM","放置位置":"","备注":"","入出库日期":"2020/5/30","是否标记":"是","盘点人":"周小青"},
    {"仓库名代码":100,"包装箱号":"冷作钢","钢种":"SLD-MAGIC","形状":"F","厚(mm)":10,"宽(mm)":55,"长(mm)":240,"数量":1,"重量(kg)":1.036,"替换钢种":" 否 ","母材尺寸":"F 24X90X240MM","放置位置":"","备注":"","入出库日期":"2020/5/30","是否标记":"是","盘点人":"周小青"},
    {"仓库名代码":100,"包装箱号":"冷作钢","钢种":"SLD-MAGIC","形状":"R","厚(mm)":10,"宽(mm)":0,"长(mm)":2975,"数量":1,"重量(kg)":1.834,"替换钢种":" 否 ","母材尺寸":"R 10MM","放置位置":"","备注":"","入出库日期":"2020/5/30","是否标记":"是","盘点人":"周小青"},
    {"仓库名代码":100,"包装箱号":"冷作钢","钢种":"SLD-MAGIC","形状":"R","厚(mm)":10,"宽(mm)":0,"长(mm)":1947,"数量":10,"重量(kg)":12,"替换钢种":" 否 ","母材尺寸":"R 10MM","放置位置":"","备注":"","入出库日期":"2020/5/30","是否标记":"是","盘点人":"周小青"},
    {"仓库名代码":100,"包装箱号":"冷作钢","钢种":"SLD-MAGIC","形状":"R","厚(mm)":10,"宽(mm)":0,"长(mm)":970,"数量":3,"重量(kg)":1.79,"替换钢种":" 否 ","母材尺寸":"R 10X1976MM","放置位置":"","备注":"","入出库日期":"2020/5/30","是否标记":"是","盘点人":"周小青"},
    {"仓库名代码":100,"包装箱号":"冷作钢","钢种":"SLD-MAGIC","形状":"R","厚(mm)":10,"宽(mm)":0,"长(mm)":965,"数量":31,"重量(kg)":18.445,"替换钢种":" 否 ","母材尺寸":"R 10MM","放置位置":"","备注":"","入出库日期":"2020/5/30","是否标记":"是","盘点人":"周小青"},
    {"仓库名代码":100,"包装箱号":"冷作钢","钢种":"SLD-MAGIC","形状":"R","厚(mm)":10,"宽(mm)":0,"长(mm)":936,"数量":6,"重量(kg)":3.462,"替换钢种":" 否 ","母材尺寸":"R 10MM","放置位置":"","备注":"","入出库日期":"2020/5/30","是否标记":"是","盘点人":"周小青"},
    {"仓库名代码":100,"包装箱号":"冷作钢","钢种":"SLD-MAGIC","形状":"R","厚(mm)":10,"宽(mm)":0,"长(mm)":935,"数量":6,"重量(kg)":3.456,"替换钢种":" 否 ","母材尺寸":"R 10MM","放置位置":"","备注":"","入出库日期":"2020/5/30","是否标记":"是","盘点人":"周小青"},
    {"仓库名代码":100,"包装箱号":"冷作钢","钢种":"SLD-MAGIC","形状":"R","厚(mm)":10,"宽(mm)":0,"长(mm)":0,"数量":56,"重量(kg)":140.698,"替换钢种":" 否 ","母材尺寸":"","放置位置":"","备注":"","入出库日期":"2020/5/30","是否标记":"是","盘点人":"周小青"},
    {"仓库名代码":100,"包装箱号":"-","钢种":"YAG250","形状":"R","厚(mm)":1.5,"宽(mm)":0,"长(mm)":1000,"数量":309,"重量(kg)":0.969,"替换钢种":" 否 ","母材尺寸":"","放置位置":"","备注":"","入出库日期":"2020/5/30","是否标记":"是","盘点人":"周小青"},
    {"仓库名代码":100,"包装箱号":"高速钢","钢种":"YXM1","形状":"R","厚(mm)":12,"宽(mm)":0,"长(mm)":955,"数量":1,"重量(kg)":0.878,"替换钢种":" 否 ","母材尺寸":"R 12X2964MM","放置位置":"","备注":"","入出库日期":"2020/5/30","是否标记":"是","盘点人":"周小青"},
    {"仓库名代码":100,"包装箱号":"高速钢","钢种":"YXM1","形状":"R","厚(mm)":12,"宽(mm)":0,"长(mm)":888,"数量":1,"重量(kg)":0.817,"替换钢种":" 否 ","母材尺寸":"R 12MM","放置位置":"","备注":"","入出库日期":"2020/5/30","是否标记":"是","盘点人":"周小青"},
    {"仓库名代码":100,"包装箱号":"高速钢","钢种":"YXM1","形状":"R","厚(mm)":12,"宽(mm)":0,"长(mm)":0,"数量":124,"重量(kg)":472.555,"替换钢种":" 否 ","母材尺寸":"","放置位置":"","备注":"","入出库日期":"2020/5/30","是否标记":"是","盘点人":"周小青"},
    {"仓库名代码":100,"包装箱号":"高速钢","钢种":"YXM1","形状":"F","厚(mm)":10,"宽(mm)":250,"长(mm)":400,"数量":2,"重量(kg)":16.26,"替换钢种":" 否 ","母材尺寸":"F 16X260MM","放置位置":"","备注":"","入出库日期":"2020/5/30","是否标记":"是","盘点人":"周小青"},
    {"仓库名代码":100,"包装箱号":"高速钢","钢种":"YXM1","形状":"F","厚(mm)":10,"宽(mm)":205,"长(mm)":304,"数量":1,"重量(kg)":5.048,"替换钢种":" 否 ","母材尺寸":"F 75X310X2885MM","放置位置":"","备注":"","入出库日期":"2020/5/30","是否标记":"是","盘点人":"周小青"},
    {"仓库名代码":100,"包装箱号":"高速钢","钢种":"YXM1","形状":"F","厚(mm)":10,"宽(mm)":177,"长(mm)":362,"数量":1,"重量(kg)":5.19,"替换钢种":" 否 ","母材尺寸":"F 90X310X1528MM","放置位置":"","备注":"","入出库日期":"2020/5/30","是否标记":"是","盘点人":"周小青"},
    {"仓库名代码":100,"包装箱号":"高速钢","钢种":"YXM1","形状":"F","厚(mm)":10,"宽(mm)":155,"长(mm)":1670,"数量":1,"重量(kg)":20.967,"替换钢种":" 否 ","母材尺寸":"F 10X155MM","放置位置":"","备注":"","入出库日期":"2020/5/30","是否标记":"是","盘点人":"周小青"},
    {"仓库名代码":100,"包装箱号":"高速钢","钢种":"YXM1","形状":"F","厚(mm)":10,"宽(mm)":155,"长(mm)":0,"数量":3,"重量(kg)":159.6,"替换钢种":" 否 ","母材尺寸":"","放置位置":"","备注":"","入出库日期":"2020/5/30","是否标记":"是","盘点人":"周小青"},
    {"仓库名代码":100,"包装箱号":"高速钢","钢种":"YXM1","形状":"F","厚(mm)":10,"宽(mm)":148,"长(mm)":155,"数量":1,"重量(kg)":1.865,"替换钢种":" 否 ","母材尺寸":"F 10X155X533MM","放置位置":"","备注":"","入出库日期":"2020/5/30","是否标记":"是","盘点人":"周小青"},
    {"仓库名代码":100,"包装箱号":"高速钢","钢种":"YXM1","形状":"R","厚(mm)":10,"宽(mm)":0,"长(mm)":3960,"数量":21,"重量(kg)":49.953,"替换钢种":" 否 ","母材尺寸":"","放置位置":"","备注":"","入出库日期":"2020/5/30","是否标记":"是","盘点人":"周小青"},
    {"仓库名代码":100,"包装箱号":"高速钢","钢种":"YXM1","形状":"R","厚(mm)":10,"宽(mm)":0,"长(mm)":957,"数量":1,"重量(kg)":0.609,"替换钢种":" 否 ","母材尺寸":"R 10X1963MM","放置位置":"","备注":"","入出库日期":"2020/5/30","是否标记":"是","盘点人":"周小青"},
    {"仓库名代码":100,"包装箱号":"高速钢","钢种":"YXM1","形状":"R","厚(mm)":10,"宽(mm)":0,"长(mm)":946,"数量":8,"重量(kg)":4.816,"替换钢种":" 否 ","母材尺寸":"R 10X3960MM","放置位置":"","备注":"","入出库日期":"2020/5/30","是否标记":"是","盘点人":"周小青"},
    {"仓库名代码":100,"包装箱号":"高速钢","钢种":"YXM1","形状":"R","厚(mm)":10,"宽(mm)":0,"长(mm)":0,"数量":259,"重量(kg)":683.417,"替换钢种":" 否 ","母材尺寸":"","放置位置":"","备注":"","入出库日期":"2020/5/30","是否标记":"是","盘点人":"周小青"},
    {"仓库名代码":100,"包装箱号":"高速钢","钢种":"YXM1","形状":"F","厚(mm)":8,"宽(mm)":155,"长(mm)":598,"数量":1,"重量(kg)":6.006,"替换钢种":" 否 ","母材尺寸":"F 8X155MM","放置位置":"","备注":"","入出库日期":"2020/5/30","是否标记":"是","盘点人":"周小青"},
    {"仓库名代码":100,"包装箱号":"高速钢","钢种":"YXM1","形状":"F","厚(mm)":8,"宽(mm)":155,"长(mm)":0,"数量":5,"重量(kg)":190,"替换钢种":" 否 ","母材尺寸":"","放置位置":"","备注":"","入出库日期":"2020/5/30","是否标记":"是","盘点人":"周小青"},
    {"仓库名代码":100,"包装箱号":"高速钢","钢种":"YXM1","形状":"F","厚(mm)":6,"宽(mm)":155,"长(mm)":450,"数量":1,"重量(kg)":16,"替换钢种":" 否 ","母材尺寸":"","放置位置":"","备注":"","入出库日期":"2020/5/30","是否标记":"是","盘点人":"周小青"},
    {"仓库名代码":100,"包装箱号":"高速钢","钢种":"YXM1","形状":"F","厚(mm)":6,"宽(mm)":155,"长(mm)":0,"数量":7,"重量(kg)":226.03,"替换钢种":" 否 ","母材尺寸":"F 6X155MM","放置位置":"","备注":"","入出库日期":"2020/5/30","是否标记":"是","盘点人":"周小青"},
    {"仓库名代码":100,"包装箱号":"高速钢","钢种":"YXM27C","形状":"RG","厚(mm)":6.2,"宽(mm)":0,"长(mm)":3000,"数量":2,"重量(kg)":1.333,"替换钢种":" 否 ","母材尺寸":"","放置位置":"","备注":"","入出库日期":"2020/5/30","是否标记":"是","盘点人":"周小青"},
    {"仓库名代码":100,"包装箱号":"高速钢","钢种":"YXM27C","形状":"RG","厚(mm)":5.1,"宽(mm)":0,"长(mm)":2500,"数量":2,"重量(kg)":0.667,"替换钢种":" 否 ","母材尺寸":"","放置位置":"","备注":"","入出库日期":"2020/5/30","是否标记":"是","盘点人":"周小青"},

  ]

export default {
  name: 'index',
  data () {
    return {
      pageNum: 1,
      pageSize: 100,
      pringAll: 1,
      data1: data1,
      data2: data2,
      sentData: '',
      dialog: false,
      updateDialog: false,
      total: 0,
      johnTab: 0,
      elDialog: false,
      multipleSelection: [],
      qrCodes: [],
      formData: {
        storageType: '',
        storageId: '',
        size1Start: '',
        size2Start: '',
        size3Start: '',
        size1End: '',
        size2End: '',
        size3End: '',
        materialType: '',
        changeNo: '',
        soNo: '',
        shape: '',
        isPaste: '',
        inStock: 1,
        stockRemarks: '',
        printCount: '',
        latestToDateStr: '',
        countStart: '',
        countEnd: ''
      },
      options: [],
      listData: []
    }
  },
  created () {
    this.getList(1, 100)
  },
  methods: {
    // 点击选料单号
    selectSono (row) {
      let str = row.substring(0, row.indexOf('-'))
      let url = '/orderSelect/selectMaterial/' + str
      this.http(url).then(resp => {
        if (resp.success) {
          this.sentData = resp.data
          this.dialog = true
        } else {
          this.$message.error({
            message: resp.message,
            duration: 1000
          })
        }
      })
    },

    // 返回数组
    getArray (str) {
      if (str) {
        return str.split(',')
      } else {
        return ''
      }
    },

    // 初始化盘点
    initSign () {
      const loading = this.$loading({
        lock: true,
        text: '初始化中...',
        spinner: 'el-icon-loading',
        background: 'rgba(0, 0, 0, 0.7)'
      })
      console.log(loading)
      this.http('/tMaterial/inItSign', {}).then(resp => {
        if (resp.success) {
          loading.close()
          this.$message({
            message: resp.message,
            type: 'success'
          })
          console.log(loading)
        } else {
          loading.close()
          this.$message({
            message: '初始化盘点失败，请稍后再试！',
            type: 'warning'
          })
          console.log(loading)
        }
      })
    },
    // 标志
    isPaste (row) {
      if (row.isPaste === '1') {
        return '数据与标签一致'
      } else if (row.isPaste === '2') {
        return '数据与标签不一致'
      } else {
        return '无'
      }
    },
    // 打印单个、全部二维码
    printOneAll (num) {
      this.pringAll = num
      this.elDialog = true
    },
    // 获取列表
    getList (pageNum, pageSize) {
      this.http('/tMaterial/list', {
        pageNum,
        pageSize,
        inStock: 1
      }).then(resp => {
        console.log(resp)
        if (resp.success) {
          this.listData = resp.data.list
          this.total = resp.data.total
        }
      })
    },
    // 导出excel
    exportExcel () {
      /* generate workbook object from table */
      let wb = XLSX.utils.table_to_book(document.querySelector('#out-table'))
      /* get binary string as output */
      let wbout = XLSX.write(wb, { bookType: 'xlsx', bookSST: true, type: 'array' })
      try {
        FileSaver.saveAs(new Blob([wbout], { type: 'application/octet-stream' }), '材料.xlsx')
      } catch (e) {
        if (typeof console !== 'undefined') console.log(e, wbout)
      }
      return wbout
    },
    // 查询
    onSubmit (pageSize, pageNum) {
      this.formData.pageSize = pageSize
      this.formData.pageNum = pageNum
      this.http('/tMaterial/list', this.formData).then(resp => {
        console.log(resp)
        if (resp.success) {
          this.pageSize = pageSize
          this.pageNum = pageNum
          this.listData = resp.data.list
          this.total = resp.data.total
        }
      })
    },
    // 获取货架编号
    typeChange () {
      this.http('/tStorageLocation/find', {
        storageType: this.formData.storageType
      }).then(resp => {
        this.options = []
        if (resp.success) {
          resp.data.map(item => {
            this.options.push({
              label: item.name,
              value: item.id
            })
          })
        }
      })
    },
    resetForm (formName) {
      this.$refs[formName].resetFields()
    },
    handleSizeChange (val) {
      this.pageSize = parseInt(`${val}`)
      this.onSubmit(this.pageSize, this.pageNum)
    },
    handleCurrentChange (val) {
      this.pageNum = parseInt(`${val}`)
      this.onSubmit(this.pageSize, this.pageNum)
    },
    cutFun (index, row) {
      console.log(index, row)
    },
    addFun (index, row) {
      console.log(index, row)
    },
    // 选择数据
    handleSelectionChange (val) {
      this.multipleSelection = val
      console.log(val)
      this.qrCodes = val.map(item => {
        // let obj = {
        //   id: item.id,
        //   code: item.qrCode,
        //   size: item.stockSizeNote,
        //   name: item.gradeCdKey
        // }
        return item
      })
    },
    // 匹配数据
    toUpdate () {
      this.updateDialog = true
    },
    // 更新数据
    updateData () {
      this.http('/tMaterial/initData', {}).then(resp => {
        if (resp.success) {
          this.getList(1, 10)
        } else {
          this.$message.error(resp.message)
        }
      })
    }
  },
  computed: {
    initShow () {
      let num = this.$store.state.initShow
      if (num === 999) {
        return true
      } else {
        return false
      }
    }
  },
  components: {
    printQR,
    toUpdate,
    orderDetail,
    PlTable,
    PlTableColumn
  }
}
</script>

<style scoped>
  .john-tab b {
    margin-left: 10px;
  }
  .position {
    line-height: 35px;
    border-bottom: 1px solid #ccc;
    padding-left: 10px;
  }
  .position span {
    color: #409EFF;
  }
  .form {
    border:1px solid #ccc;
    padding: 10px;
    margin: 10px;
  }
  .data-list {
    margin: 10px;
  }
  .form-item {
    width:180px;
  }
  .input-row {
    display: inline-block;
    line-height: 38px;
  }
  .input-row label {
    margin-right: 7px;
  }
  .input-left,.input-right,.input-center {
    display: inline-block;
  }
  .btns {
    float: right;
    margin-top: 10px;
  }
  .block {
    text-align: right;
    padding: 20px 10px;
    background: #efefef;
    border: 1px solid #ddd;
    border-top: none;
  }
  .data-list {
    height: calc(100% - 180px);
  }
  .select-sono {
    list-style: none;
  }
  .select-sono li {
    cursor: pointer;
  }
  .table td {
    padding: 6px 10px;
  }
</style>
